# 알고리즘과 시스템의 구분
# 시스템 : 체계, 즉 각 요소들간의 복잡한 상호적관계*구조가 필요(맞물려 작용하는게 포인트)

# 알고리즘 : 특정한 작업을 수행하기 위한 정확한 단계별 절차 또는 계획획
# 컴퓨터 엔지니어가 알아둘 3대 알고리즘
# - 정렬 알고리즘 : 데이터를 특정한 순서로 정렬하는 방법
# - 검색 알고리즘 : 주어진 데이터 집합에서 특정한 항목을 콕 집어 찾는 방법
# - 그래프 알고리즘 : 길찾기와 같이 다양한 그래프 구조에서 문제를 해결하는 방법을 다룸.

# 환경(environment) : 맥락에 맞게 조성된 공간
# 구성(Setting) : 환경을 구성하는 요소들
# 설정(Configuration) : 환경을 용도에 맞게 조절하는 것

# Parameter vs Argument
def f(x) :
    return 2*x+4
# f(x)는 함수, x는 매개변수(parameter)

# 3이라는 실제 숫자를 Argument(인자)로 입력하면
# 함수에 정의된 연산에 따라 적절한 결과값이 return

# None과 0의 차이.
# num=0 은 0이라는 값을 할당한 것이고, num=None 은 아무것도 할당하지 않은 것이다.

# 왜 None을 쓰는가?
# 초기화 : 프로그램의 어느 부분에서 어떻게 변수를 사용할 지 명확.
# 조건부 할당/반환 : 조건에 따라 변수에 값을 할당하지 않거나,
# 함수가 값을 반환하지 않을 수 있음

# 클래스와 인스턴스
# 클래스 : 분류, 어떤 것이 무엇인지 정의해둔 것
# 인스턴스  : 실체, 구체적으로 만들어진 존재/대상

